*** Ionization potentials
- Return to this [2024-01-30 Tue]
  - I want to expand the table and figure to include ions that are seen in the Spitzer spectra
  - These are
    - Ne II, III
    - Si I (this is the only element that I did not have)
    - S III, IV
- Where did I get these from? [2022-10-22 Sat]
  - Looks like https://en.wikipedia.org/wiki/Ionization_energies_of_the_elements_(data_page)
- [2024-02-01 Thu] Turns out that I had a mistake in my figure with the Spitzer images. It is not [Si IV], but [S IV] 10.51 micron that we see.
- This is good because we now have two adjacent stages of the same element
     
|      |       eV |   Ryd |
|------+----------+-------|
| K^0   |  4.34066 | 0.319 |
| Si^0  |  8.15169 | 0.599 |
| S^0   |  10.3600 | 0.762 |
| Cl^0  |  12.9676 | 0.954 |
|------+----------+-------|
| H^0   |  13.5984 | 1.000 |
| O^0   |  13.6181 | 1.001 |
| N^0   |  14.5341 | 1.069 |
| Ar^0  |  15.7596 | 1.159 |
| Si^{+}  | 16.34585 | 1.202 |
| Ne^0  |  21.5646 | 1.586 |
| S^{+}   |   23.338 | 1.716 |
| Cl^{+}  |   23.814 | 1.751 |
| C^{+}   |   24.385 | 1.793 |
|------+----------+-------|
| He^0  |  24.5874 | 1.808 |
| Ar^{+}  |   27.630 | 2.032 |
| N^{+}   |   29.601 | 2.177 |
| K^{+}   |    31.63 | 2.326 |
| Si^{+2} | 33.49302 | 2.463 |
| S^{+2}  |    34.86 | 2.564 |
| O^{+}   |   35.121 | 2.583 |
| Cl^{+2} |    39.80 | 2.927 |
| Ne^{+}  | 40.96328 | 3.012 |
| Ar^{+2} |   40.735 | 2.996 |
| Si^{+3} | 45.14181 | 3.320 |
| K^{+2}  |   45.806 | 3.368 |
| S^{+3}  |   47.222 | 3.473 |
| Cl^{+3} |    53.24 | 3.915 |
|------+----------+-------|
| He^{+}  |   54.418 | 4.002 |
| O^{+2}  |   54.936 | 4.040 |
| Ar^{+3} |    59.58 | 4.381 |
| K^{+3}  |    60.91 | 4.479 |
| Ne^{+2} |    63.45 | 4.666 |
| K^{+4}  |    82.66 | 6.079 |
#+TBLFM: $3=$2 / 13.5984;f3
+ So this might explain why [O III] does not overlap with He II, but [Ar IV] does
|   IP | Edge     | H        | He         | S       | Ar       | O       | Cl       | Si       | K      | Ne       |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
|  8.2 | Si 0     |          |            |         |          | [O I]   |          | *[Si II] |        |          |
| 10.4 | S 0      |          |            | [S II]  |          | [O I]   |          | *[Si II] |        |          |
| 13.0 | Cl 0     |          |            | [S II]  |          | [O I]   | [Cl II]  | *[Si II] |        |          |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
| 13.6 | H 0, O 0 | H I 4861 |            | [S II]  |          | [O II]  | [Cl II]  | *[Si II] |        |          |
| 15.8 | Ar 0     | H I 4861 |            | [S II]  | [Ar II]  | [O II]  | [Cl II]  | *[Si II] |        |          |
| 16.3 | Si +     | H I 4861 |            | [S II]  | [Ar II]  | [O II]  | [Cl II]  |          |        |          |
| 21.6 | Ne 0     | H I 4861 |            | [S II]  | [Ar II]  | [O II]  | [Cl II]  |          |        | *[Ne II] |
| 23.3 | S +      | H I 4861 |            | [S III] | [Ar II]  | [O II]  | [Cl II]  |          |        | *[Ne II] |
| 23.8 | Cl +     | H I 4861 |            | [S III] | [Ar II]  | [O II]  | [Cl III] |          |        | *[Ne II] |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
| 24.6 | He 0     | H I 4861 | He I 5875  | [S III] | [Ar II]  | [O II]  | [Cl III] |          |        | *[Ne II] |
| 27.6 | Ar +     | H I 4861 | He I 5875  | [S III] | [Ar III] | [O II]  | [Cl III] |          |        | *[Ne II] |
| 33.5 | Si +2    | H I 4861 | He I 5875  | [S III] | [Ar III] | [O II]  | [Cl III] |          |        |          |
| 34.9 | S +2     | H I 4861 | He I 5875  | *[S IV] | [Ar III] | [O II]  | [Cl III] |          |        | *[Ne II] |
| 35.1 | O +      | H I 4861 | He I 5875  | *[S IV] | [Ar III] | [O III] | [Cl III] |          |        | *[Ne II] |
| 39.8 | Cl +2    | H I 4861 | He I 5875  | *[S IV] | [Ar III] | [O III] | [Cl IV]  |          |        | *[Ne II] |
| 40.7 | Ar +2    | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          |        | *[Ne II] |
| 41.0 | Ne +     | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          |        | [Ne III] |
| 45.1 | Si +3    | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          |        |          |
| 45.8 | K +2     | H I 4861 | He I 5875  | *[S IV] | [Ar IV]  | [O III] | [Cl IV]  |          | [K IV] | [Ne III] |
| 47.2 | S +3     | H I 4861 | He I 5875  |         | [Ar IV]  | [O III] | [Cl IV]  |          | [K IV] | [Ne III] |
| 53.2 | Cl +3    | H I 4861 | He I 5875  |         | [Ar IV]  | [O III] |          |          | [K IV] | [Ne III] |
|------+----------+----------+------------+---------+----------+---------+----------+----------+--------+----------|
| 54.4 | He +     | H I 4861 | He II 4686 |         | [Ar IV]  | [O III] |          |          | [K IV] | [Ne III] |
| 54.9 | O +2     | H I 4861 | He II 4686 |         | [Ar IV]  |         |          |          | [K IV] | [Ne III] |
| 59.6 | Ar +3    | H I 4861 | He II 4686 |         |          |         |          |          | [K IV] | [Ne III] |
| 60.9 | K +3     | H I 4861 | He II 4686 |         |          |         |          |          |        | [Ne III] |
| 63.5 | Ne +2    | H I 4861 | He II 4686 |         |          |         |          |          |        |          |
** Look at fractional excess in different features
- Compare the following
  - medium ionization peak
  - globules
  - bow shock
- In a bunch of different lines
  - measure in DS9

| Line      | sii 6731        | hei 5875        | hi 4861         | siii 9069       | ariii 7136      | oiii 5007       |
|-----------+-----------------+-----------------+-----------------+-----------------+-----------------+-----------------|
| BG left   | 380 +/- 30      | 1200 +/- 100    | 12000 +/- 1000  | 1490 +/- 90     | 980 +/- 60      | 83800 +/- 3900  |
| Med Peak  | 620             | 1630            | 15600           | 2200            | 1300            | 98200           |
| BG mid    | 770 +/- 30      | 1590 +/- 50     | 15500 +/- 380   | 1590 +/- 90     | 1170 +/- 40     | 99700 +/- 1500  |
| Bow shock | 990             | 2210            | 21120           | 1910            | 1530            | 135600          |
| BG Glob   | 1420 +/- 115    | 2160 +/- 60     | 20600 +/- 330   | 1750 +/- 90     | 1500 +/- 50     | 129000 +/- 3000 |
| Globule   | 1940            | 2480            | 23000           | 2360            | 1760            | 136600          |
| BG right  | 590 +/- 100     | 1800 +/- 100    | 17200 +/- 930   | 1910 +/- 100    | 1410 +/- 50     | 115500 +/- 2800 |
|-----------+-----------------+-----------------+-----------------+-----------------+-----------------+-----------------|
| Med Peak  | 0.078 +/- 0.037 | 0.168 +/- 0.041 | 0.135 +/- 0.039 | 0.429 +/- 0.045 | 0.209 +/- 0.034 | 0.070 +/- 0.023 |
| Bow Shock | 0.286 +/- 0.041 | 0.390 +/- 0.034 | 0.363 +/- 0.026 | 0.201 +/- 0.058 | 0.308 +/- 0.036 | 0.360 +/- 0.016 |
| Globule   | 0.930 +/- 0.104 | 0.253 +/- 0.030 | 0.217 +/- 0.027 | 0.290 +/- 0.038 | 0.210 +/- 0.025 | 0.117 +/- 0.017 |
#+TBLFM: @9$7..@9$2=2 (@3 - (@2 + @4)/2)/(@2 + @4);f3::@10$7..@10$2=(@5 - @4)/@4;f3::@11$7..@11$2=2 (@7 - (@6 + @8)/2)/(@6 + @8);f3

- Final table of the contrasts for each line and each feature
  - I have omitted sii from bow shock, since that is clearly the flank of the second globule peak
  - I have also omitted Hi and Hei since they do not really add anything


#+name: emline-excess-table
| Line             |    MP |   eMP |    BS |   eBS |    BG |  eBG" |
| [S II]\n6731"    | 0.078 | 0.037 |     0 |     0 | 0.930 | 0.104 |
| "[S III]\n9069"  | 0.429 | 0.045 | 0.201 | 0.058 | 0.290 | 0.038 |
| "[Ar III]\n7136" | 0.209 | 0.034 | 0.308 | 0.036 | 0.210 | 0.025 |
| "H I\n4861"      | 0.135 | 0.039 | 0.363 | 0.026 | 0.217 | 0.027 |
| "[O III]\n5007"  | 0.070 | 0.023 | 0.360 | 0.016 | 0.117 | 0.017 |

#+header: :var TAB=emline-excess-table
#+begin_src python :tangle ../scripts/emline-excess.py :eval no
  from astropy.table import Table
  from matplotlib import pyplot as plt
  import seaborn as sns
  sns.set_context("talk")
  tab = Table(rows=TAB[1:], names=TAB[0])
  figfile = "emline-excess-plot.pdf"
  fig, ax = plt.subplots()
  line, = ax.plot(tab["Line"], tab["MP"])
  ax.errorbar(tab["Line"], tab["MP"], yerr=tab["eMP"], fmt="o", color=line.get_color())
  line, = ax.plot(tab["Line"], tab["BS"])
  ax.errorbar(tab["Line"], tab["BS"], yerr=tab["eBS"], fmt="D", color=line.get_color())
  line, = ax.plot(tab["Line"], tab["BG"])
  ax.errorbar(tab["Line"], tab["BG"], yerr=tab["eBG"], fmt="s", color=line.get_color())
  ax.set(ylabel="Brightness / Background")
  sns.despine()
  fig.tight_layout()
  fig.savefig(figfile)
  print(figfile, end="")
#+end_src

#+begin_src sh :results file
  python ../scripts/emline-excess.py # 1>&2
#+end_src

#+RESULTS:
[[file:emline-excess-plot.pdf]]


- [X] Next job is to plot this
** Cl IV diagnostics

#+begin_src python :results output verbatim
  import pyneb as pn
  cl4 = pn.Atom("Cl", 4)
  Ts = [10000, 15000, 20000]
  dens = [1.0, 10.0, 100.0]
  e8046 = cl4.getEmissivity(tem=Ts, den=dens, wave=8046)
  e7531 = cl4.getEmissivity(tem=Ts, den=dens, wave=7531)
  e5323 = cl4.getEmissivity(tem=Ts, den=dens, wave=5323)
  print("8046", e8046)
  print("7531/8046", e7531 / e8046)
  print("5323/7531", e5323 / e7531)
#+end_src

#+RESULTS:
: 8046 [[1.67869951e-20 1.67889008e-20 1.68077082e-20]
:  [2.67346244e-20 2.67362017e-20 2.67518043e-20]
:  [3.31965858e-20 3.31978359e-20 3.32102162e-20]]
: 7531/8046 [[0.28610481 0.28610481 0.28610481]
:  [0.28610481 0.28610481 0.28610481]
:  [0.28610481 0.28610481 0.28610481]]
: 5323/7531 [[0.08643893 0.08643919 0.08644182]
:  [0.22672898 0.22673009 0.22674121]
:  [0.35442452 0.35442619 0.35444295]]

***** He II 4686 emissivity
- This comes straight from pyneb
  - result is *9.59e-25 erg.cm^3/s*

#+begin_src python :return result :results verbatim
  import pyneb as pn
  heii = pn.RecAtom('He', 2)
  result = heii.getEmissivity(tem=[15500], den=30, wave=4686)
#+end_src

#+RESULTS:
: [9.59135484e-25]

**** DONE Rematch for the He++ ionization fraction at inner edge
CLOSED: [2024-04-24 Wed 11:13]
:PROPERTIES:
:ID:       89812E2B-AB5E-40BB-9554-381D8B61119D
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-04-24 Wed 11:13] \\
  I seem to have gone as far as possible with this now. Preferred solution is x = 0.5, but all we can really say is that x < 0.8
- State "TODO"       from              [2024-04-24 Wed 10:19] \\
  I am updating this to incorporate the new determination of the H density from [[id:C56D5FC4-B477-4D73-9748-6F8F3CF27B3D][The density from the Balmer line jump reconsidered]] below
:END:
- The original calculation from 2021 in [[id:6A6EC6C8-4754-4B62-8A8D-231CCFC9C677][Estimating He++ ionization fraction]] in the [[file:ngc-346.org]] notebook, together with the ionizing luminosities from the stellar atmosphere models
- The key additional data that we need is the photoionization cross section for He+
  - This is hydrogenic, so it just scales as sigma(Z, E) = (sigma_0 / Z^2) (E/Z^2 E_0)^{-3}
  - At threshold it is therefore sigma_0 / Z^2 = 1.5e-18 cm^2
  - Question is, what is the average value over the He II ionizing spectrum? This will depend on the spectra slope. But could easily give a reduction by a factor of 2.
  - From the stellar SEDs, it looks like continuum is very steep there
- Local ionization balance is
  - F \sigma n(He+) = \alpha_B n_e n(He++)
  - x / (1-x) = F \sigma / \alpha_B n_e
- We can define a characteristic hydrogen density corresponding to 50% ionization
  - n* = F \sigma / x_e \alpha_B = 5.82e7 0.5 1.5e-18 / 1.08 2.163e-12 = 19 cm^-3
    - This assumes that the mean cross section is 0.5 times the threshold value
    - Also assumes that He++ contribution to electrons is small
  - x / (1-x) = n* / n
  - So we would need n = 180 to get x = 0.1
- But from [[id:8AC74CFB-86FA-4705-B13B-028ED6E2BAE5][Finding product of electron and He++ densities]] we also have n^2 x = 169
- It seems that these two equations have similar derivations, so maybe things can be simplified
  1. F =  \alpha_B \int n_e n(He^{++}) dr : Global through shell
  2. F = \alpha_B n_e n(He^{++}) / \sigma n(He+) : Local at inner edge of shell
- This has the solution
  - x_0 = 1 - \tau^-1
  - where \tau is the optical depth that the shell would  have if all its He were in the form of He+
  - \tau = \sigma n(He) dr = \sigma y n dr
    - where n is the hydrogen density and y = 0.0824 is the He abundance
- Uncertainties in the ingredients that go into \tau
  - cross section \sigma = (0.5 +/- 0.25) 1.5e-18 cm^2 (relative uncertainty 50%)
  - y = 0.0824 +/- 0.004 (relative uncertainty 5%)
  - n = 19 +/- 8 cm^-3 (relative uncertainty 40%) from the jump in H alpha surface brightness
  - dr = 8.6 +/- 2.0 pixels (relative uncertainty 23%) giving 1.6e18 cm
- Putting it all together
  - \tau = 0.5 1.5e-18 0.0824 19 1.6e18 = 1.88
  - x = 0.71
  - Adding the relative uncertainties in quadrature gives sqrt(0.5**2 + 0.05**2 + 0.4**2 + 0.2**2) = 0.67
  - **Final answer**
    - So \tau = 1.88 +/- 1.26 and *x = 0.47 +/- 0.36*
    - Note that the errors on x are not realistic, since x is positive definite and tau = 1 (x = 0) is in the +/- 1 sigma interval. Physically, tau cannot be larger than 1. So, what we have really is an upper limit.
      | sigmas |  tau |    x |
      |--------+------+------|
      |      0 | 1.88 | 0.47 |
      |      1 | 3.14 | 0.68 |
      |      2 |  4.4 | 0.77 |
      |      3 | 5.66 | 0.82 |
      #+TBLFM: $2=1.88 + $1 1.26::$3=1-1/$2;f2
    - So the 1 sigma upper limit is x < 0.68 and the 3 sigma upper limit is x < 0.82
    - But in the other direction, we cannot exclude the possibility that x is very small. 
- What empirical data and assumptions go into this estimate?
  1. H density in shell
     - Comes from Ha brightness jump
     - Plus assumption of cylindrical symmetry to get geometric depth from chord length
  2. Shell thickness
  3. He abundance
  4. He+ photoionization cross section
    
***** Find e(6563) and hence the emission measure
#+begin_src python :return eha
  import pyneb as pn
  hi = pn.RecAtom('H', 1)
  eha = hi.getEmissivity(tem=[13800, 15500], den=1e2, wave=6563)
#+end_src

#+RESULTS:
| 2.59886957e-25 | 2.32174194e-25 |

- So the average is 2.46e-25 erg/s/cm^3
- Emission measure is 4\pi I(6563) / e(6563)
  : 4 pi 1.29e-4 / 2.46e-25 = 6.59e21 /cm^5
